<template>
  <v-container>
    <h1 class="mt-3">利用規約</h1>
    <p class="mt-5 ml-2">この利用規約（以下，「本規約」といいます。）は，このウェブサイトの管理人（以下，「当管理人」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。</p>

    <h2 class="mt-8">第1条（適用）</h2>
    <ol class="mt-3 ml-6">
      <li>本規約は，ユーザーと当管理人との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
      <li class="mt-2">当管理人は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。</li>
      <li class="mt-2">本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。</li>
    </ol>

    <h2 class="mt-8">第2条（利用登録）</h2>
    <p class="mt-3 ml-4">本サービスにおいては，登録希望者が本規約に同意の上，当管理人の定める方法によって利用登録をすることによって，利用登録が完了するものとします。</p>

    <h2 class="mt-8">第3条（メールアドレスおよびパスワードの管理）</h2>
    <ol class="mt-3 ml-6">
      <li>ユーザーは，自己の責任において，メールアドレスおよびパスワードを適切に管理するものとします。</li>
      <li class="mt-2">ユーザーは，いかなる場合にも，メールアドレスおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当管理人はメールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には，その情報を登録しているユーザー自身による利用とみなします。</li>
      <li class="mt-2">メールアドレス及びパスワードが第三者によって使用されたことによって生じた損害は，当管理人に故意又は重大な過失がある場合を除き，当管理人は一切の責任を負わないものとします。</li>
    </ol>

    <h2 class="mt-8">第4条（禁止事項）</h2>
    <p class="mt-3 ml-4">ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。</p>
    <ol class="ml-6">
      <li>法令または公序良俗に違反する行為</li>
      <li class="mt-2">犯罪行為に関連する行為</li>
      <li class="mt-2">本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為</li>
      <li class="mt-2">当管理人，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為</li>
      <li class="mt-2">本サービスによって得られた情報を商業的に利用する行為</li>
      <li class="mt-2">当管理人のサービスの運営を妨害するおそれのある行為</li>
      <li class="mt-2">不正アクセスをし，またはこれを試みる行為</li>
      <li class="mt-2">他のユーザーに関する個人情報等を収集または蓄積する行為</li>
      <li class="mt-2">不正な目的を持って本サービスを利用する行為</li>
      <li class="mt-2">本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</li>
      <li class="mt-2">他のユーザーに成りすます行為</li>
      <li class="mt-2">当管理人のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</li>
      <li class="mt-2">その他，当管理人が不適切と判断する行為</li>
    </ol>

    <h2 class="mt-8">第5条（本サービスの提供の停止等）</h2>
    <ol class="mt-3 ml-6">
      <li>当管理人は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</li>
      <ol class="mt-5 ml-6">
        <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
        <li class="mt-2">地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</li>
        <li class="mt-2">コンピュータまたは通信回線等が事故により停止した場合</li>
        <li class="mt-2">その他，当管理人が本サービスの提供が困難と判断した場合</li>
      </ol>
      <li class="mt-5">当管理人は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。</li>
    </ol>

    <h2 class="mt-8">第6条（利用制限および登録抹消）</h2>
    <ol class="mt-3 ml-6">
      <li>当管理人は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。</li>
      <ol class="mt-5 ml-6">
        <li>本規約のいずれかの条項に違反した場合</li>
        <li class="mt-2">その他，当管理人が本サービスの利用を適当でないと判断した場合</li>
      </ol>
      <li class="mt-5">当管理人は，本条に基づき当管理人が行った行為によりユーザーに生じた損害について，一切の責任を負いません。</li>
    </ol>

    <h2 class="mt-8">第7条（退会）</h2>
    <p class="mt-3 ml-4">ユーザーは，当管理人の定める退会手続により，本サービスから退会できるものとします。</p>

    <h2 class="mt-8">第8条（保証の否認および免責事項）</h2>
    <ol class="mt-3 ml-6">
      <li>当管理人は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
      <li class="mt-2">当管理人は，本サービスに起因してユーザーに生じたあらゆる損害について、当管理人の故意又は重過失による場合を除き、一切の責任を負いません。ただし，本サービスに関する当管理人とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</li>
      <li class="mt-2">当管理人は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。</li>
    </ol>

    <h2 class="mt-8">第9条（サービス内容の変更等）</h2>
    <p class="mt-3 ml-4">当管理人は，ユーザーに事前の告知をせず、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。</p>

    <h2 class="mt-8">第10条（利用規約の変更）</h2>
    <p class="mt-3 ml-4">当管理人は、ユーザーの個別の同意を要せず、本規約を変更することができるものとします。</p>

    <h2 class="mt-8">第11条（個人情報の取扱い）</h2>
    <p class="mt-3 ml-4">当管理人は，本サービスの利用によって取得する個人情報については，当管理人「プライバシーポリシー」に従い適切に取り扱うものとします。</p>

    <h2 class="mt-8">第12条（通知または連絡）</h2>
    <p class="mt-3 ml-4">ユーザーと当管理人との間の通知または連絡は，当管理人の定める方法によって行うものとします。当管理人は,ユーザーから,当管理人が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。</p>

    <h2 class="mt-8">第13条（権利義務の譲渡の禁止）</h2>
    <p class="mt-3 ml-4">ユーザーは，当管理人の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>

    <h2 class="mt-8">第14条（準拠法・裁判管轄）</h2>
    <ol class="mt-3 ml-6">
      <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
      <li>本サービスに関して紛争が生じた場合には，当管理人の本店所在地を管轄する裁判所を専属的合意管轄とします。</li>
    </ol>

    <p class="mt-15 mb-10" align="right">以上</p>
  </v-container>
</template>

<script>
export default {
  name: "TermsOfService"
}
</script>

<style scoped>
</style>